{
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "O",
    "1": "B-OBJECT",
    "2": "I-OBJECT",
    "3": "B-ATTRIBUTE",
    "4": "I-ATTRIBUTE",
    "5": "B-STYLE",
    "6": "I-STYLE",
    "7": "B-ENVIRONMENT",
    "8": "I-ENVIRONMENT",
    "9": "B-LIGHTING",
    "10": "I-LIGHTING"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-ATTRIBUTE": 3,
    "B-ENVIRONMENT": 7,
    "B-LIGHTING": 9,
    "B-OBJECT": 1,
    "B-STYLE": 5,
    "I-ATTRIBUTE": 4,
    "I-ENVIRONMENT": 8,
    "I-LIGHTING": 10,
    "I-OBJECT": 2,
    "I-STYLE": 6,
    "O": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.6",
  "vocab_size": 30522
}
